# bitfalcon.yaml  (AGPL/GPL ではなく MIT or BSD 等で自作)
# yolo detect train model=models/bitfalcon.yaml scale=l
# ──────────────────────────────
# Global parameters
nc: 2              # classes: person, face
scales:            # depth, width, max_ch
  n: [0.33, 0.25, 256]
  s: [0.33, 0.50, 256]
  m: [0.67, 0.75, 512]
  l: [1.00, 1.00, 768]

# ──────────────────────────────
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,   [64, 3, 2]]      # P1/2
  - [-1, 1, Conv,   [128, 3, 2]]     # P2/4
  - [-1, 3, RELAN,  [128, True]]     # depth ×3
  - [-1, 1, Conv,   [256, 3, 2]]     # P3/8
  - [-1, 6, RELAN,  [256, True]]
  - [-1, 1, Conv,   [512, 3, 2]]     # P4/16
  - [-1, 6, RELAN,  [512, True]]
  - [-1, 1, Conv,   [768, 3, 2]]     # P5/32
  - [-1, 3, RELAN,  [768, True]]
  - [-1, 1, SepConv7x7, [768, 768]]

neck:
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, AreaAttn, [384]]
  - [-1, 1, Conv, [384, 3, 1]]

  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, AreaAttn, [192]]
  - [-1, 1, Conv, [192, 3, 1]]

head:
  - [[15, 11, 7], 1, BitDetect, [nc]]
